import { Dice } from '../types/Dice.type'

const tentouDiceData: Dice[] = [
  {
    number: "1",
    name: "キイロメツブテントウ",
    description: "体長1.5mm程度と小さく、長らく採集例の少ない珍しい種でした。日本には安定して１つ星模様のあるテントウムシはいません。本種は昔の図鑑では無紋とされていましたが、近年の報告で紋が出る変異が確認されました。"
  },
  {
    number: "2",
    name: "フタホシテントウ",
    description: "青緑色の眼が美しい小型のテントウムシです。２つ星のテントウはたくさんいますが、フタホシというストレートな名前の為、ダイスのデザインに選びました。"
  },
  {
    number: "3",
    name: "ミスジキイロテントウ",
    description: "芝生に生息する外来種で、その細長い体からハムシと間違えられがちです。頭と胸の赤い部分は独特の透明感があります。ちなみに３つ星のテントウは日本にはいません（海外にはいます）。"
  },
  {
    number: "4",
    name: "ヨツボシテントウ",
    description: "丸みの強い小型の可愛らしいテントウムシです。成虫も幼虫もコナラやクヌギのアブラムシを食べます。幼虫は平べったい変わった体型で、化学擬態によってアリからの攻撃を避けていると思われます。九州の個体は黄色が強く出ます。"
  },
  {
    number: "5",
    name: "ダイモンテントウ",
    description: "本州の高山帯にのみ生息します。ハイマツという背の低いマツに付くアブラムシを食べます。頭を下に見た時、翅の赤い部分が大の字に見えることから、ダイモンというセンスのある和名が付けられたと思われます。"
  },
  {
    number: "6",
    name: "ムツボシテントウ",
    description: "メツブテントウ族というグループの中で、最も普通に見られる種です。主に夜行性と考えられ、冬場の数℃の中でも活動が観察されています。更に、本種は雄が１匹も見つかっておらず、単為生殖（雌が自分のクローンを生む）すると考えられています。"
  }
]

export { tentouDiceData }